# FailedDowngradeCrossToElbow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..FailedDowngradeCrossToElbow Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
Failed to downgrade tee type to elbow type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedDowngradeCrossToElbow { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedDowngradeCrossToElbow As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedDowngradeCrossToElbow {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace